// ------------------------------------------------------------------------------
// name: index
// ------------------------------------------------------------------------------

import * as Module from './module';

// Actions And Mutation Types
// 用于缓存的读写，dispatch 调用，以及各方的统一命名
// 注意，为了方便理解和管理，Actions 和 Mutation 共用一套同名规则进行一一对应

// --------------------------------------------------------------------------
// 环境信息
// --------------------------------------------------------------------------
export const ENV_INFO = `${Module.ENV}/info`; // url 参数和硬件环境信息



// --------------------------------------------------------------------------
// demo
// --------------------------------------------------------------------------
export const DEMO_A = `${Module.A}/name-a`;
export const DEMO_B = `${Module.B}/name-b`;



